#### DuctFittingAndAccessoryData Members

---

|  |
| --- |
| DuctFittingAndAccessoryData Class   Methods   Properties   See Also |

The  DuctFittingAndAccessoryData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DuctFittingAndAccessoryData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAllConnectorData | Gets the connector data of the pipe fitting or pipe accessory. |
| Public method | GetEntity | Returns an Entity of the Schema of the serverGUID. or an invalid entity otherwise. |
| Public method | GetFamilyInstanceId | Gets the Id of the fiting or accessory instance |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AirViscosity | The air viscosity of the duct fitting or duct accessory, Units: (kg/(ftÂ·s)). |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Origin | The origin position of the duct fitting or duct accessory. |
| Public property | PartType | The part type of the duct fitting or duct accessory. |
| Public property | ServerGUID | The GUID of the duct fitting or duct accessory. |
| Public property | SystemClassification | The system classification of the duct fitting or duct accessory. |

# See Also

DuctFittingAndAccessoryData Class

Autodesk.Revit.DB.Mechanical Namespace